Revit 2027 API
DockablePaneState.DockPosition Property
 Which part of the Revit application frame the pane should dock to.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public DockPosition DockPosition { get; set; }
Public Property DockPosition As DockPosition
	Get
	Set
public:
property DockPosition DockPosition {
	DockPosition get ();
	void set (DockPosition value);
}
member DockPosition : DockPosition with get, set
Property Value
DockPosition
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
DockablePaneState Class
Autodesk.Revit.UI Namespace